namespace NumberInWords

module Dictionary =

    let getStupidTen (u : char) =
        match u with
            | '1' -> "одиннадцать"
            | '2' -> "двенадцать"
            | '3' -> "тринадцать"
            | '4' -> "четырнадцать"
            | '5' -> "пятнадцать"
            | '6' -> "шестнадцать"
            | '7' -> "семнадцать"
            | '8' -> "восемнадцать"
            | '9' -> "девятнадцать"
            |  _  -> ""

    let hundreds (c : char) =
        match c with
            | '1' -> "сто"
            | '2' -> "двести"
            | '3' -> "триста"
            | '4' -> "четыреста"
            | '5' -> "пятьсот"
            | '6' -> "шестьсот"
            | '7' -> "семьсот"
            | '8' -> "восемьсот"
            | '9' -> "девятьсот"
            |  _  -> ""

    let tens (c : char) (u : char) =
        match c with
            | '1' -> getStupidTen u
            | '2' -> "двадцать"
            | '3' -> "тридцать"
            | '4' -> "сорок"
            | '5' -> "пятьдесят"
            | '6' -> "шестьдесят"
            | '7' -> "семьдесят"
            | '8' -> "восемьдесят"
            | '9' -> "девяносто"
            |  _  -> ""

    let unitsM (c: char) (t : char) = 
        match (c, t) with
            | (_, '1') -> ""
            | ('1', _) -> "один"
            | ('2', _) -> "два"
            | ('3', _) -> "три"
            | ('4', _) -> "четыре"
            | ('5', _) -> "пять"
            | ('6', _) -> "шесть"
            | ('7', _) -> "семь"
            | ('8', _) -> "восемь"
            | ('9', _) -> "девять"
            |  _       -> ""

    let unitsF (c: char) (t : char) = 
        match (c, t) with
            | (_, '1') -> ""
            | ('1', _) -> "одна"
            | ('2', _) -> "две"
            | ('3', _) -> "три"
            | ('4', _) -> "четыре"
            | ('5', _) -> "пять"
            | ('6', _) -> "шесть"
            | ('7', _) -> "семь"
            | ('8', _) -> "восемь"
            | ('9', _) -> "девять"
            |  _       -> ""

    let units (c : char) (t : char) (gender : char) =
        match gender with
            | 'f' -> unitsF c t
            |  _  -> unitsM c t

    let terminationForThousands (t : char) (u : char) =
        match (t, u) with
            | ('1', _) -> ""
            | (_, '1') -> "а"
            | (_, '2') | (_, '3') | (_, '4') -> "и"
            | _ -> ""

    let terminationForMillions (t : char) (u : char) =
        match (t, u) with
            | ('1', _) -> "ов"
            | (_, '1') -> ""
            | (_, '2') | (_, '3') | (_, '4') -> "а"
            | _ -> "ов"          

